src/InformationRegisters/Документ_ЗаявкаПокупателя_ДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Документ_ЗаявкаПокупателя_ДополнительныеРеквизиты</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Документ_ЗаявкаПокупателя_ДополнительныеРеквизиты/Ext/ManagerModule.bsl
Процедура ЗафиксироватьДопСвойство(Объект, Свойство, Значение) Экспорт
	
	лКлючАлгоритма = "РегистрСведений_ДокументЗаявкаПокупателя_ДополнительныеРеквизиты_ЗафиксироватьДопСвойство";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.Документ_ЗаявкаПокупателя_ДополнительныеРеквизиты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Объект;
		МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов[Свойство];
		МенеджерЗаписи.Значение = Значение;
		МенеджерЗаписи.Записать();
	Исключение
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(Объект, 
		Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаОпределенияДопСвойстваЗаявки, 
		ОписаниеОшибки(),,,,
		"РегистрСведений.ДокументЗаявкаПокупателя_ДополнительныеРеквизиты_ЗафиксироватьДопСвойство");
	КонецПопытки;
	
	
КонецПроцедуры
